app/views/pictures/edit.html.erb

    <%= f.label :order, "Position in queue" %>
    <%= f.number_field :order, min: 1, max: Picture.count %>
---
SELECT COUNT(*) FROM "pictures"