app/controllers/logs_controller.rb

SELECT "logs".* FROM "logs" ORDER BY "logs"."posted_at" DESC
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" IN (?, ?, ?)  [["id", 980190963], ["id", 298486374], ["id", 980190962]]
---
  def index
    @logs = Log.includes(:picture).order(posted_at: :desc)