app/controllers/pictures_controller.rb

SELECT "pictures".* FROM "pictures" ORDER BY "pictures"."order" ASC
SELECT MAX("pictures"."order") FROM "pictures"
---
  def index
    @pictures = Picture.order(:order)

SELECT 1 AS one FROM "pictures" LIMIT ?  [["LIMIT", 1]]
INSERT INTO "pictures" ("alt_text", "content_type", "created_at", "hashtags", "order", "original_filename", "s3_key", "sensitive_content", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    files = Array(params[:pictures]&.[](:files)).reject(&:blank?)

    if files.empty?
      redirect_to new_picture_path, alert: "Please select at least one file."
      return
    end

    files.each do |file|
      tempfile = file.tempfile.path
      ExifSanitizer.new(tempfile).sanitize!

      key = "pictures/#{SecureRandom.uuid}/#{file.original_filename}"
      S3Client.new.upload(key, tempfile, content_type: file.content_type)

      Picture.create!(
        s3_key: key,
        original_filename: file.original_filename,
        content_type: file.content_type
      )

UPDATE "pictures" SET "alt_text" = ?, "hashtags" = ?, "sensitive_content" = ?, "updated_at" = ? WHERE "pictures"."id" = ?  [["alt_text", "Updated alt"], ["hashtags", "#new #tags"], ["sensitive_content", "nudity"], ["updated_at", "2026-03-16 06:28:44.256362"], ["id", 980190962]]
---
  def update
    new_order = params[:picture][:order]&.to_i

    if new_order && new_order != @picture.order
      @picture.reorder_to(new_order)
    end

    if @picture.update(picture_params)

DELETE FROM "pictures" WHERE "pictures"."id" = ?  [["id", 980190962]]
---
  def destroy
    S3Client.new.delete(@picture.s3_key)